def return_toilet_dict():
    toilet_dict = {}
    toilet_dict['1호선'] = ['망월사', '도봉산', '도봉', '방학', '창동', '녹천', '월계', 
        '석계', '신이문', '외대앞', '신설동', '동묘앞', '동대문', '종로3가', '남영', 
        '용산', '대방', '신길', '영등포', '신도림', '구로', '구일', '부평', '간석']
    toilet_dict['2호선'] = ['시청', '을지로3가', '동대문역사문화공원', '왕십리', '건대입구', 
        '종합운동장', '강남', '신림', '신대방', '구로디지털단지', '대림', '신도림', 
        '영등포구청', '당산', '신답', '용두', '신설동', '양천구청']
    toilet_dict['3호선'] = ['대곡', '지축', '연신내', '무악재', '독립문', '경복궁', 
        '종로3가', '을지로3가', '충무로', '동대입구', '약수', '금호', '옥수', '신사', 
        '잠원', '남부터미널', '양재', '대치', '대청', '수서', '가락시장', '경찰병원', '오금']
    toilet_dict['4호선'] = ['상계', '노원', '창동', '성신여대입구', '동대문역사문화공원', 
        '충무로', '명동', '회현', '삼각지', '이촌', '동작', '총신대입구', '이수', '사당', '남태령', 
        '과천', '정부과천청사', '금정', '상록수', '한대앞', '고잔', '중앙', '초지']
    toilet_dict['5호선'] = ['신정', '양평', '여의도', '종로3가', '왕십리', 
        '올림픽공원', '오금']
    toilet_dict['6호선'] = ['디지털미디어시티', '월드컵경기장', '창신', '안암', '고려대', '석계']
    toilet_dict['7호선'] = ['도봉산', '상봉', '건대입구', '뚝섬유원지', '이수', '남성', 
        '부천종합운동장', '부평구청']
    toilet_dict['8호선'] = ['가락시장']
    toilet_dict['9호선'] = ['김포공항', '당산', '국회의사당', '노량진', '동작', 
        '고속터미널', '석촌', '올림픽공원']
    toilet_dict['경의중앙선'] = ['대곡', '신촌', '용산', '이촌', '서빙고', '옥수', 
        '응봉', '왕십리', '상봉']
    toilet_dict['분당선'] = ['왕십리', '기흥', '수원']
    toilet_dict['수인선'] = ['원인재']
    toilet_dict['신분당선'] = ['강남', '양재', '양재시민의숲', '청계산입구', '판교', '정자']
    toilet_dict['공항철도'] = ['공항화물청사', '운서', '검암', '계양', '김포공항', 
        '마곡나루', '디지털미디어시티', '홍대입구', '공덕', '서울역']
    toilet_dict['의정부경전철'] = ['탑석', '의정부시청', '경전철의정부']
    toilet_dict['우이신설경전철'] = ['신설동', '성신여대입구', '화계', '북한산우이']
    toilet_dict['경춘선'] = ['상봉']
    toilet_dict['서해선(소사-원시)'] = ['초지', '원시']
    toilet_dict['인천 1호선'] = ['계양', '국제업무지구', '센트럴파크', '신연수', 
        '원인재', '인천대입구', '캠퍼스타운', '테크노파크', '부평', '부평삼거리']
    toilet_dict['인천 2호선'] = ['운연']
    toilet_dict['경강선'] = []
    toilet_dict['에버라인'] = []

    return toilet_dict